# RoomDesignLightingLoadPerAreaParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomDesignLightingLoadPerAreaParam Property
ParameterTypeId Class See Also
---
"Specified Lighting Load per area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomDesignLightingLoadPerAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomDesignLightingLoadPerAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomDesignLightingLoadPerAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace